import '@babel/polyfill';
import dva from 'dva';
import { createBrowserHistory } from 'history';
import { hydrate, render } from "react-dom";

import './assets/css/normalize.css';
import './assets/fonts/iconfont.css';
// 全局样式
import './assets/less/global.less';

const preloadedState = window.__PRELOADED_STATE__;

delete window.__PRELOADED_STATE__;

// 1. Initialize
const app = dva({
  history: createBrowserHistory(),
  initialState: preloadedState || {}
});

// 2. Plugins
// app.use({});

// 3. Model
app.model(require('./models/common').default);
app.model(require('./models/store').default);
app.model(require('./models/money').default);
app.model(require('./models/warehouse').default);

// 4. Router
app.router(require('./routers/router').default);

// 5. Start
const App = app.start();

window.snapSaveState = () => ({
  __PRELOADED_STATE__: app._store.getState()
});

window.says = {
  food: [
    '如果你觉得自己很没用，请记得你还能吐出二氧化碳给植物',
    '今天吃喝不努力，明天努力找吃喝',
    '马不停的是蹄，你不停的是嘴',
    '只有填满肚子，人才不会空虚',
    '真的吃货，是把月供看成月饼',
    '唯一可以不劳而获的，只有脂肪',
    '没吃饱只有一种烦恼，吃饱了有无数的烦恼',
    '你所有的忧伤，都来自于你的余额',
    '别人努力会成功，你努力会有饭吃',
    '很多人觉得自己活得太累，实际上，他们可能只是睡得太晚',
    '直到长胖了，才悟出饱了就别吃了，这么深刻的道理',
    '想得到你想要的东西，最好的办法就是让自己配得上它'
  ],
  digital: [
    '有钱的时候：老板我扫你。贫穷的时候：老板我给你现金，剩下的我再扫你',
    '难过到极致的时候，通常会变得很冷静',
    '时间就是金钱，我在浪费时间？不～我只是在炫富！',
    '邪恶是善良的人们编造的谎言',
    '生活不仅有眼前的苟且，还有远方的枸杞',
    '年轻人不要怕迷茫，迷茫不丢人',
    '假如生活欺骗了你，你就打开美颜相机，欺骗所有的人',
    '没有人会直接给你荣华富贵，只有给你平台和机会',
    '挣钱是一种能力，花钱是一种技术，我能力有限技术却很高'
  ],
  fashion: [
    '别人都用名牌包包，而你只能用用表情包',
    '有时间绝望的话，还不如吃点好吃的然后睡个好觉',
    '有钱能买来幸福吗？不能，有钱本身就是幸福！',
    '有钱人可以选择低调，而你却只能低调',
    '明明可以靠脸吃饭，你却靠才华，这就是你跟明明的差距',
    '你的脸，一分天注定，九分看滤镜',
    '喜欢一个人是藏不住的，就算躲在衣柜里，还是会被她老公发现',
    '不是吃燕窝的人皮肤好，是吃得起燕窝的人皮肤好',
    '有时候，别人在炫富我都不知道，我连名牌都不认识几个'
  ],
  journey: [
    '我对钱不感兴趣，但我对花钱很感兴趣',
    '有人一笑就很好看，你是一看就挺好笑' ,
    '年轻时我以为钱就是一切，现在老了才知道，确实如此',
    '年轻人，如果你怕压力那就白活了',
    '机会是留给有准备的人，没机会的人，就别瞎准备了',
    '能用钱解决的都不是问题，但如何有钱，才是你最大的问题',
    '有时候，只要你下定决心做某件事，全世界都会拖你后腿',
    '很多时候，乐观的态度和好听的话帮不了你',
    '人生没有过不去的坎，过不去，只是因为你腿短',
    '由于性格太内向，一直做不出，抢着结账这种事',
    '不要埋怨现在的经历凄惨，跟未来比，还差的远呢',
    '钱买不来爱情，但是可以买走爱情',
  ],
  investment: [
    '你永远赚不到超出你认知范围之外的钱，除非靠运气',
    '你的投资眼光不错，我很欣赏你',
    '像你考虑问题这么细，不成功才怪',
    '要保持乐观的心态，悲观的人不可能创业成功',
    '一顿操作猛如虎，一看工资二千五',
    '我做事就是不要赚钱',
    '钱是世界上最容易得到的东西',
    '这世界总有1%的人，你说什么他们都不相信，没有必要花时间和他们生气',
    '未来房价如葱',
    '天下没有人靠炒股发财的',
    '只要锄头挥得好，没有墙角挖不倒',
    '真正努力过的人才知道，智商上的差距是不可逾越的',
    '谁说我不会乐器？我退堂鼓打的可好了',
    '在理性消费领域，你是棒棒哒',
    '爱情带来的快乐是短暂的，只有钱带来的快乐才是永久的',
    '那些靠运气赚到的钱，之后往往又会靠实力亏掉'
  ],
  charity: [
    '我就喜欢静静的看你任性的样子',
    '如果你不喜欢现在的工作，要么辞职不干，要么就闭嘴不言',
    '中国企业一定要给普通员工加工资',
    '我招人从来不看简历',
    '好想把房子卖了，去环游世界，可惜房东不同意',
    '顺其自然只是无能为力的另一种说法',
    '西游记告诉我们，有个猪一样的队友，能让团队上西天',
    '不要再说被骗色了，到你这个年纪来的都是客',
    '幸亏你去年没洗头，要不然你今年，炒菜连油都没有'
  ],
  praise: [
    '谁的童话书又没合好让公主跑出来了',
    '我真的是服了你这个沉鱼落雁的仙女',
    '你真好看，我不是在夸你，我只是在提醒你',
    '你眨一下眼，就翻阅了我心里的春夏秋冬',
    '遇见你之后，再看别的女人，就好像在侮辱自己的眼睛!',
    '快停止发散魅力吧，你这个浑身充满魅力的家伙',
    '生活很讨厌，还好你够可爱',
    '今天本该没有那么惊喜，但是你来了',
    '千秋无绝色，悦目是佳人',
    '遇见你，是所有故事的开始',
    '莎士比亚说，爱情是种病。我想病入膏肓再寻你做解药',
    '你是星星吗，有棱有角，还会闪闪发光，难怪你这么耀眼'
  ]
};

const rootElement = document.getElementById("root");
if (rootElement.hasChildNodes()) {
  hydrate(<App />, rootElement);
} else {
  render(<App />, rootElement);
}
